Revit 2026 API

# FilledRegionTypeIsValidBackgroundPatternId Method

---

Check if the id is valid for a background pattern

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool IsValidBackgroundPatternId(
	ElementId patternId
)
```
```vb
Public Function IsValidBackgroundPatternId (
	patternId As ElementId
) As Boolean
```
```cpp
public:
bool IsValidBackgroundPatternId(
	ElementId^ patternId
)
```
```fsharp
member IsValidBackgroundPatternId :
        patternId : ElementId -> bool
```

#### Parameters

patternId ElementId
     Element id of the FillPatternElement

#### Return Value

Boolean False if the FillPatternElement is a model pattern. True otherwise.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

The FillPatternElement must be a 'Drafting' pattern.

#### Reference

FilledRegionType Class

Autodesk.Revit.DB Namespace